In [1]:
import pandas as pd

In [2]:
data = {'Name':['ali', 'hassan', 'hossein', 'fateme'],
       'Age':[20, 18, 30, 40],
       'Gender':['M', 'M', 'M', 'F']}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

      Name  Age Gender
0      ali   20      M
1   hassan   18      M
2  hossein   30      M
3   fateme   40      F

In [5]:
df.head(2)

     Name  Age Gender
0     ali   20      M
1  hassan   18      M

In [6]:
df.tail(3)

      Name  Age Gender
1   hassan   18      M
2  hossein   30      M
3   fateme   40      F

In [7]:
df.describe()

             Age
count   4.000000
mean   27.000000
std    10.132456
min    18.000000
25%    19.500000
50%    25.000000
75%    32.500000
max    40.000000

In [8]:
df.describe(include='all')

       Name        Age Gender
count     4   4.000000      4
unique    4        NaN      2
top     ali        NaN      M
freq      1        NaN      3
mean    NaN  27.000000    NaN
std     NaN  10.132456    NaN
min     NaN  18.000000    NaN
25%     NaN  19.500000    NaN
50%     NaN  25.000000    NaN
75%     NaN  32.500000    NaN
max     NaN  40.000000    NaN

In [9]:
df.sort_values('Name')

      Name  Age Gender
0      ali   20      M
3   fateme   40      F
1   hassan   18      M
2  hossein   30      M

In [10]:
df.sort_values('Age', ascending=False)

      Name  Age Gender
3   fateme   40      F
2  hossein   30      M
0      ali   20      M
1   hassan   18      M

In [11]:
df['Name']

0        ali
1     hassan
2    hossein
3     fateme
Name: Name, dtype: object

In [12]:
df.Name

0        ali
1     hassan
2    hossein
3     fateme
Name: Name, dtype: object

In [13]:
df[['Name', 'Gender']]

      Name Gender
0      ali      M
1   hassan      M
2  hossein      M
3   fateme      F

In [14]:
df[1:3]

      Name  Age Gender
1   hassan   18      M
2  hossein   30      M

In [16]:
df[df.Age>20]

      Name  Age Gender
2  hossein   30      M
3   fateme   40      F

In [17]:
titanic = pd.read_csv('titanic.csv')

In [18]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [20]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [21]:
titanic.Age.min()

0.42

In [22]:
titanic.Age.max()

80.0

In [23]:
df = pd.DataFrame({'A':[1, 2], 'B':[10,20]})

In [24]:
df

   A   B
0  1  10
1  2  20

In [25]:
def square(x):
    return x*x

In [26]:
df['C'] = df['B'].apply(square)

In [27]:
df

   A   B    C
0  1  10  100
1  2  20  400

In [28]:
df['D'] = df["B"].apply(lambda x: x**3)

In [29]:
df

   A   B    C     D
0  1  10  100  1000
1  2  20  400  8000